import React from 'react';

interface UserWelcomeTextProps {
  userType: string;
}

const UserWelcomeText: React.FC<UserWelcomeTextProps> = ({ userType }) => {
  const ownerText = (
    <>
      Вітаємо у системі управління!
      <br />
      Ви успішно увійшли як власник. Тепер ви маєте доступ до повного
      функціоналу для ефективного керування компанією:
      <br />
      • Керуйте інформацією про Компанію та налаштовуйте дані про Офіси.
      <br />
      • Контролюйте Комунальні послуги та оптимізуйте витрати.
      <br />
      • Створюйте та обробляйте Замовлення, управляйте Провайдерами послуг.
      <br />
      • Налаштовуйте свій Особистий акаунт для більш персоналізованого досвіду.
      <br />
      Бажаємо продуктивної роботи з нашою платформою!
    </>
  );

  const managerText = (
    <>
      Вітаємо у системі управління!
      <br />
      Ви успішно увійшли як менеджер. Тепер ви маєте доступ до основних функцій
      для підтримки роботи офісу:
      <br />
      • Контролюйте Комунальні послуги та оптимізуйте витрати.
      <br />
      • Створюйте та обробляйте Замовлення, управляйте Провайдерами послуг.
      <br />
      • Налаштовуйте свій Особистий акаунт для більш персоналізованого досвіду.
      <br />
      Бажаємо продуктивної роботи з нашою платформою!
    </>
  );

  if (userType === '1') {
    return <>{ownerText}</>;
  } else if (userType === '2') {
    return <>{managerText}</>;
  } else {
    return <>Сталася помилка. Невідомий тип користувача.</>;
  }
};

export default UserWelcomeText;
